app/views/journals/_form.html.erb

SELECT `accounts`.* FROM `accounts`   ORDER BY `accounts`.`account_number` ASC
---
    <div class="col-sm-9">
      <%= f.collection_select :account_id, Account.order(:account_number),:id,:account_name %>

SELECT `expense_types`.* FROM `expense_types`   ORDER BY `expense_types`.`name` ASC
---
      <div class="col-sm-9">
        <%= f.collection_select :expense_type_id, ExpenseType.order(:name),:id,:name %>