app/controllers/accounts_controller.rb

SELECT `accounts`.* FROM `accounts`   ORDER BY account_number
---
  def index
    @accounts = Account.order('account_number')

INSERT INTO "accounts" ("account_name", "account_number", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_name", "House Maintenanc"], ["account_number", 11], ["created_at", "2015-03-21 06:35:46.933774"], ["updated_at", "2015-03-21 06:35:46.933774"], ["user_id", 1]]
---
  def create
    @account = current_user.accounts.new(account_params)
    @account.save