app/controllers/expense_types_controller.rb

  def index
    @expense_types = ExpenseType.all
---
SELECT `expense_types`.* FROM `expense_types`

  def create
    @expense_type = ExpenseType.new(expense_type_params)
    @expense_type.save
---
INSERT INTO "expense_types" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-03-21 06:37:00.932913"], ["name", "Cash"], ["updated_at", "2015-03-21 06:37:00.932913"], ["user_id", 1]]

    def set_expense_type
      @expense_type = ExpenseType.find(params[:id])
---
SELECT  "expense_types".* FROM "expense_types"  WHERE "expense_types"."id" = $1 LIMIT 1  [["id", 1]]