app/controllers/journals_controller.rb

  def index
    @journals = current_user.journals.all
---
SELECT "journals".* FROM "journals"  WHERE "journals"."user_id" = $1  [["user_id", 1]]

  def create
    @journal = current_user.journals.new(journal_params)
    @journal.save
---
INSERT INTO `journals` (`account_id`, `amount`, `created_at`, `description`, `expense_type_id`, `journal_date`, `payee`, `updated_at`, `user_id`) VALUES (3, 100.0, '2015-03-20 14:13:47', 'test', 1, '2015-02-03', 'test', '2015-03-20 14:13:47', 1)

  def update
    @journal.update(journal_params)
---
UPDATE `journals` SET `amount` = 100.0, `updated_at` = '2015-03-20 08:45:12' WHERE `journals`.`id` = 2

  def destroy
    @journal.destroy
---
DELETE FROM `journals` WHERE `journals`.`id` = 4

    def set_journal
      @journal = Journal.find(params[:id])
---
SELECT  `journals`.* FROM `journals`  WHERE `journals`.`id` = 4 LIMIT 1